---
kind: method
id: M:Autodesk.Revit.DB.Mesh.GetNormals
source: html/999d2218-7ed2-e16d-059e-2a2fa8eb093b.htm
---
# Autodesk.Revit.DB.Mesh.GetNormals Method

Returns all normals assigned to the mesh.

## Syntax (C#)
```csharp
public IList<XYZ> GetNormals()
```

## Returns
An array of XYZ values, each representing a normal unit vector.